//1. З масиву [1, 2, 3, 4, 5] зробіть масив [1, 4, 5]

const array = [1, 2, 3, 4, 5];
array.splice(1, 2);

//2. З масиву [1, 2, 3, 4] запишіть в новий масив [2, 3, 4]

const array1 = [1, 2, 3, 4];
array1.shift();
//const newArray = array1.slice(1); другий варіант

//3. З масиву [1, 2, 3, 4, 5] зробіть масив [1, 'w', 'tr-td', 2, 3, 4, 'vv', 5, 'aa']

const array2 = [1, 2, 3, 4, 5];
array2.splice(1, 0, 'w', 'tr-td');
array2.splice(6, 0, 'vv');
array2.splice(8, 0, 'aa'); //array2.push('aa')
 
//1. Дано два масиви: [1,2,3] і [4,5,6]. Об'єднайте їх у масив [1,2,3,4,5,6]

const array3 = [1,2,3];
const array4 = [4,5,6];
const array5 = array.concat(array3, array4);

//2. Даний масив [1,2,3]. Зробіть з нього масив [3,2,1].

const array6 = [1,2,3];
array6.reverse();

//3. Даний масив [3,4,5]. Додайте йому в кінець елементи 4, 8, 10.

const array7 = [3, 4, 5];
array7.push (4, 8, 10);

//4. Даний масив ['aaa', 'bbb', 'ccc']. Виведіть в консоль останній елемент та видаліть його з масива.

const array8 = ['aaa', 'bbb', 'ccc'];
console.log(array8.pop());

//5. Даний масив ['3', 7, 10]. Додайте йому на початок елементи 2, 8.

const array9 = ['3', 7, 10];
array9.unshift(2, 8);

//6. Дано масив ['3', 7, 10]. Отримайте з нього рядок.

const array10 = ['3', 7, 10];
array10.join('+');

//7. Є масив: const arr = [2, 44, 11, 234, 8, 2, 4, 1] Зробити новий масив, всі елементи якого = елемент зі старого масиву + 100

const array11 = [2, 44, 11, 234, 8, 2, 4, 1];
array11.forEach((key) => {
    console.log(key + 100);
})